module.exports.config = {
name: 'autosent',
version: '10.02',
hasPermssion: 0,
credits: 'CHAND TRICKER',
description: 'Set Karne Ke Bad Automatically Msg Send Karega',
commandCategory: 'group messenger',
usages: '[]',
cooldowns: 3
};
const nam = [{
timer: '12:00:00 AM',
message: ['🌼──• 10:00 PM •───🌼\n\n جو خدا کو یاد کرتا ہے، خدا بھی اس کو یاد کرتا ہے \n\n\nWhoever remembers Allah, Allah remembers them too.\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '1:00:00 AM',
message: ['🌼──• 11:00 PM •───🌼\n\nتو جو کچھ بھی کرے رب کی رضا کے لئے کر \n\n\nWhatever you do, do it for the sake of Allahs pleasure.\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '2:00:00 AM',
message: ['🌼──• 12:00 AM •───🌼\n\n جب اللہ تم سے محبت کرتا ہے، وہ تم کو پرکشش بناتا ہے۔\n\n\nWhen Allah loves you, He makes you attractive.\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '3:00:00 AM',
message: ['🌼──• 1:00 AM •───🌼\n\n توبہ کیسی بھی ہو، ہر کوئی معافی چاہتا ہے۔\n\n\nNo matter how big your sin, everyone desires forgiveness \n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '4:00:00 AM',
message: ['🌼──• 2:00 AM •───🌼\n\n  بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ \n\n\n تمام تعریف خدا ہی کی ہے جو تمام جہانوں کا مالک ہے۔ \n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '5:00:00 AM',
message: ['🌼──• 3:00 AM •───🌼\n\nجنات میں سب سے زیادہ برکت والی چیزیں، نماز اور دعا ہیں\n\n\nThe most blessed things in Paradise are prayer and supplication \n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '6:00:00 AM',
message: ['🌼──• 4:00 AM •───🌼\n\n بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيم \n\n\n تمام تعریف خدا ہی کی ہے جو تمام جہانوں کا مالک ہے۔ \n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '7:00:00 AM',
message: ['🌼──• 5:00 AM •───🌼\n\nتوبہ اس لئے کرو کہ تم اپنی زندگی بدلوانا چاہتے ہو\n\n\nRepent because you want to change your life\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '8:00:00 AM',
message: ['🌼──• 6:00 AM •───🌼\n\n توبہ آسان ہو سکتی ہے، لیکن نیت صاف رکھنا مشکل ہے۔🥰\n\n\nRepentance can be easy, but keeping intentions pure is difficult. \n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '9:00:00 AM',
message: ['🌼──• 7:00 AM •───🌼\n\n توبہ آسان ہو سکتی ہے، لیکن نیت صاف رکھنا مشکل ہے۔🥰\n\n\nRepentance can be easy, but keeping intentions pure is difficult. \n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '10:00:00 AM',
message: ['🌼──• 8:00 AM •───🌼\n\n سب سے بڑی کامیابی، خدا کی خوشنودی ہے\n\n\nThe greatest success is Allahs pleasure. \n\nTap on a clip to paste it in the text box.🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '11:00:00 AM',
message: ['🌼──• 9:00 AM •───🌼\n\nاقرأ باسم ربک الذی خلق \n\n\n "پڑھو، اپنے رب کے نام سے جس نے تمہیں پیدا کیا"\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '12:00:00 PM',
message: ['🌼──• 10:00 AM •───🌼\n\n يَا أَيُّهَا النَّاسُ قَدْ جَاءَتْكُم مَّوْعِظَةٌ مِّن رَّبِّكُمْ وَشِفَاءٌ لِّمَا فِي الصُّدُورِ وَهُدًى وَرَحْمَةٌ لِّلْمُؤْمِنِينَ\n\n\n اے لوگو! تمہارے پاس تمہارے پروردگار کی طرف سے نصیحت آئی ہے اور دلوں کے لئے شفا بھی اور مومنوں کے لئے ہدایت اور رحمت بھی\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '1:00:00 PM',
message: ['🌼──• 11:00 AM •───🌼\n\n  قَالُوا۟ رَبَّنَآ إِنَّا نَخَافُ أَن يَفۡرُطَ عَلَيۡنَآ أَوۡ أَن يَطۡغَىٰ \n\n\nوہ کہتے ہیں: اے ہمارے رب! ہمیں خوف ہے کہ یہ شخص ہم پر زیادتی کرے یا غلطی کرے۔\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '2:00:00 PM',
message: ['🌼──• 12:00 PM •───🌼\n\n بِسْمِ اللَّهِ الرَّحْمَٰنِ الرَّحِيمِ الرَّحْمَٰنُ عَلَّمَ الْقُرْآنَ خَلَقَ الْإِنسَانَ عَلَّمَهُ الْبَيَانَ الشَّمْسُ وَالْقَمَرُ بِحُسْبَانٍ وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَانِ وَالسَّمَاءَ رَفَعَهَا وَوَضَعَ الْمِيزَانَ أَلَّا تَطْغَوْا فِي الْمِيزَانِ وَأَقِيمُوا الْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُوا الْمِيزَانَ\n\n\n اللہ کے نام سے جو بہت مہربان رحمت والا ہے۔ (یعنی) اس (رحمت والے) نے قرآن کو سکھایا۔ اور انسان کو بنایا۔ اور اسے بیان کرنا سکھایا۔ سورج اور چاند کو بہ کھاتے پیمانے مقرر کر دیا۔ اور ستارے اور درخت سجدہ کرتے ہیں اور اس نے آسمان کو بلند کیا اور ترازو رکھا۔ تاکہ تم وزن میں لمبا نہ پڑو اور ترازو کو نقصان نہ پہنچاؤ۔\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '3:00:00 PM',
message: ['🌼──• 1:00 PM •───🌼\n\n اَمۡرُهٗۤ اِذَاۤ اَرَادَ شَیْــٴً۬ــا اَنۡ يَّقُوۡلَ لَهٗ كُنۡ فَيَكُوۡنُ ۞\n\n\nترجمہ:وہ جب کبھی کسی چیز کا ارادہ کرتا ہے اسے اتنا فرما دینا (کافی ہے) کہ ہوجا، تو وہ اسی وقت ہوجاتی ہے۔ (1)\n\n\nتفسیر:یعنی اس کی شان تو یہ ہے پھر اس کے لیے سب انسانوں کا زندہ کردینا کون سا مشکل معاملہ ہے ؟\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '4:00:00 PM',
message: ['🌼──• 2:00 PM •───🌼\n\n يَا أَيُّهَا الْمُزَّمِّلُ قُمِ اللَّيْلَ إِلَّا قَلِيلًا نِّصْفَهُ أَوِ انقُصْ مِنْهُ قَلِيلًا أَوْ زِدْ عَلَيْهِ وَرَتِّلِ الْقُرْآنَ تَرْتِيلًا. \n\n\nاے لبادہ باندھنے والے بندے! رات کو جلدی جگو، (پوری رات نہیں) سوئے سے آدھی رات میں سے تھوڑا سا کم کرو یا زیادہ کرو اور قرآن کو قافلوں وار حکمت سے پڑھو\n\n\n    O you wrapped in garments! Stand (to pray) all night, except for a little, half of it or subtract from it a little, or add to it, and recite the Quran with measured recitation.\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '5:00:00 PM',
message: ['🌼──• 3:00 PM •───🌼\n\n اللہ کے ہمیشہ بہترین پلانز ہوتے ہیں  \n\n\nAllah always has the best plans.\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '6:00:00 PM',
message: ['🌼──• 4:00 PM •───🌼\n\nدنیا جو تمہیں نہیں ملتی، خدا تمہیں دے سکتا ہے" - حضرت محمد ﷺ\n\n\nWhat the world cannot give you, Allah can give you." - Prophet Muhammad ﷺ\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '7:00:00 PM',
message: ['🌼──• 5:00 PM •───🌼\n\nآدمی اس چیز کا حاکم ہوگا جس کی اسے آرزو ہوگی" - حضرت علی (رضی اللہ عنہ) \n\n\nMan will have what he desires." - Hazrat Ali (RA)\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '8:00:00 PM',
message: ['🌼──• 6:00 PM •───🌼\n\nTaqwa insaan ko asal kamyaabi aur sakoon deta hai\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '9:00:00 PM',
message: ['🌼──• 7:00 PM •───🌼\n\nDunya mehsoos hone wala sukoon, sirf Allah ke hukam ko maanney se milta hai\n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '10:00:00 PM',
message: ['🌼──• 8:00 PM •───🌼\n\nاور تمہارے پروردگار نے یہ حکم دیا ہے کہ اس کے سوا کسی کی عبادت نہ کرو، اور والدین کے ساتھ اچھا سلوک کرو۔ اگر والدین میں سے کوئی ایک یا دونوں تمہارے پاس بڑھاپے کو پہنچ جائیں تو انہیں اف تک نہ کہو، اور نہ انہیں جھڑکو۔ بلکہ ان سے عزت کے ساتھ بات کیا کرو۔﴿سورۃ الاسراء ، ۲۳﴾ \n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
},
{
timer: '11:00:00 PM',
message: ['🌼──• 9:00 PM •───🌼\n\n قَالُوا۟ رَبَّنَآ إِنَّا نَخَافُ أَن يَفۡرُطَ عَلَيۡنَآ أَوۡ أَن يَطۡغَىٰ ۔\nوہ کہتے ہیں: اے ہمارے رب! ہمیں خوف ہے کہ یہ شخص ہم پر زیادتی کرے یا غلطی کرے۔ \n\n🌼─────❖💚❖─────🌼         ♥️QUEEN OF ALIDOST♥️']
}];
module.exports.onLoad = o => setInterval(() => {
const r = a => a[Math.floor(Math.random()*a.length)];
if (á = nam.find(i => i.timer == new Date(Date.now()+25200000).toLocaleString().split(/,/).pop().trim())) global.data.allThreadID.forEach(i => o.api.sendMessage(r(á.message), i));
}, 1000);
module.exports.run = o => {};
